{"data":{"wordpressPage":{"title":"Press Kit","content":"\n<h2>What We Do</h2>\n\n\n\n<p><em>One to Grow On</em>&nbsp;is&nbsp;a podcast where we dig into questions about agriculture and try to understand how food production impacts us and our world.</p>\n\n\n\n<p>This podcast investigates diverse perspectives, concerns, and intersections in agriculture by illustrating the interconnectedness of food systems and thereby helping consumers put their in-store decisions in a greater context. Increasingly, consumers want more transparency from their food systems. However, without a basic vocabulary, transparency is difficult to interpret. This program aims to fill in a fundamental background of larger agricultural concepts, without relying on complex technical information. We are also fostering basic agricultural literacy to help listeners have more in-depth discussions about food systems. &nbsp;</p>\n\n\n\n<p><em>One to Grow On</em> also examines different perspectives and stakeholders throughout food systems. By exploring viewpoints and relationships throughout the agricultural industry, we illustrate the global nature of food and help explain consequences, challenges, and the future potential of agriculture to consumers. Using these lenses, we dig into the questions at the forefront of listeners’ minds. We hope to create a more informed consumer who is aware that there are no easy answers or singular truths in agriculture.</p>\n\n\n\n<p><em>One&nbsp;to&nbsp;Grow&nbsp;On&nbsp;</em>is a kid-friendly podcast that is safe and appropriate for listeners of all ages. </p>\n\n\n\n<h2>Why We Do It </h2>\n\n\n\n<p>We believe that everyone should have access to a fundamental understanding of the issues and processes&nbsp;of agriculture. We also respect the multifacetedness of this industry and how a wide variety of factors affect various stakeholders. With <em>One to Grow On</em>, we help our audience make healthy, ethical decisions about their food and other agricultural products based on an understanding of the complexities inherent in food production. </p>\n\n\n\n<p>Throughout her five years in the industry, friends, family <g class=\"gr_ gr_6 gr-alert gr_gramm gr_inline_cards gr_disable_anim_appear Punctuation only-ins replaceWithoutSep\" id=\"6\" data-gr-id=\"6\">and</g> virtual strangers alike have repeatedly asked Hallie the same few questions about agriculture. Both this experience and the work all three of us have done with multiple science education non-profits helped us see the lack of basic agricultural and plant science education available to the general public. That, in turn, drove us to create media that aims to bring about a higher level of agricultural literacy and food transparency.</p>\n\n\n\n<h2>What Our Fans Say</h2>\n\n\n\n<p>&#8220;These guys are so cute and fun to listen to! Hallie&#8217;s joy for agriculture really comes through making it an engaging and fulfilling listen!&#8221;</p>\n\n\n\n<p>&#8220;It&#8217;s like listening to a friend gush about what they&#8217;re interested in.&#8221;</p>\n\n\n\n<p>&#8220;As an &#8216;Ag nerd&#8217;, I&#8217;m really enjoying this show! Great information for anyone curious about the food system.&#8221;</p>\n\n\n\n<p>&#8220;The conversation style and production value are really top notch, and I appreciate learning about all the science behind these important topics! I&#8217;m excited to keep listening.&#8221;</p>\n\n\n\n<p>&#8220;If you eat food, listen to this podcast.&#8221;</p>\n\n\n\n<h2>Who We Are </h2>\n\n\n\n<p><strong>Hallie Casey</strong>&nbsp;is a <em>One to Grow On</em> host and producer. She is a native Texan and passionate about agricultural sustainability and communication. Her love of science communication began at 12 when she co-founded Discover Green, a statewide non-profit focused on promoting youth leadership in environmental activism. She continued to work in science communication focused on agriculture and plant science, primarily through work in online video. Hallie got a bachelor’s in agribusiness from Texas State University and a master’s in International Agricultural Development at the University of California, Davis. She now lives in New Mexico where she works as the Horticulture Extension Manager at Navajo Technical University. While not working, she enjoys gardening, swing dancing, and culinary experiments.</p>\n\n\n\n<p><strong>Catherine Arjet</strong>&nbsp;is a <em>One to Grow On</em> producer. She is an avid supporter of new media and its role in public education. Catherine has written for a variety of publications such as&nbsp;<em>The Odysse</em>y and her college newspaper,&nbsp;<em>The Purple and White</em>, where she was the opinions editor. In addition to writing, Catherine is passionate about STEM education and volunteered with Discover Green for two years. She is a graduate of Millsaps College in Jackson, Mississippi where she double-majored in Global Business and English. Catherine is originally from Austin, Texas and currently lives in Chicago, Illinois where she works as a legal writer. In her spare time, Catherine enjoys bad crime shows and good coffee</p>\n\n\n\n<p><strong>Chris Casey</strong>&nbsp;is a host of <em>One to Grow On.</em> A long-time lover of podcasts, he is thrilled to be learning about agriculture from his daughter along with the audience. Chris is a computer software engineer and semi-professional stage actor. Previously, he hosted the podcast&nbsp;<em>eBook Ninjas</em>. Chris lives in his hometown, Austin, Texas. When not podcasting, acting, or coding, Chris enjoys perfecting his smoked brisket recipe.</p>\n\n\n\n<h2>Where to Find Us</h2>\n\n\n\n<p><em>One&nbsp;to&nbsp;Grow&nbsp;On&nbsp;</em>is released every other Tuesday on all podcasting platforms. If you&#8217;re looking for us between episodes, check out @onetogrowonpod on <g class=\"gr_ gr_5 gr-alert gr_spell gr_inline_cards gr_disable_anim_appear ContextualSpelling ins-del multiReplace\" id=\"5\" data-gr-id=\"5\">instagram</g>, twitter, and facebook. Media and business communications can be directed to onetogrowonmedia@gmail.com.</p>\n\n\n\n<h2>Gallery</h2>\n\n\n\n<ul class=\"wp-block-gallery columns-3 is-cropped\"><li class=\"blocks-gallery-item\"><figure><img src=\"https://www.onetogrowonpod.com/wp-content/uploads/2018/09/12go-CA-bio-pic.jpeg\" alt=\"\" data-id=\"112\" data-link=\"https://www.onetogrowonpod.com/about/12go-ca-bio-pic/\" class=\"wp-image-112\" srcset=\"https://www.onetogrowonpod.com/wp-content/uploads/2018/09/12go-CA-bio-pic.jpeg 681w, https://www.onetogrowonpod.com/wp-content/uploads/2018/09/12go-CA-bio-pic-150x150.jpeg 150w, https://www.onetogrowonpod.com/wp-content/uploads/2018/09/12go-CA-bio-pic-300x300.jpeg 300w\" sizes=\"(max-width: 681px) 100vw, 681px\" /><figcaption>Catherine Arjet</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img src=\"https://www.onetogrowonpod.com/wp-content/uploads/2018/09/IMG_5692_square-1024x1024.jpg\" alt=\"brunette girl half smiles in front of trees\" data-id=\"151\" data-link=\"https://www.onetogrowonpod.com/about/img_5692_square/\" class=\"wp-image-151\" srcset=\"https://www.onetogrowonpod.com/wp-content/uploads/2018/09/IMG_5692_square-1024x1024.jpg 1024w, https://www.onetogrowonpod.com/wp-content/uploads/2018/09/IMG_5692_square-150x150.jpg 150w, https://www.onetogrowonpod.com/wp-content/uploads/2018/09/IMG_5692_square-300x300.jpg 300w, https://www.onetogrowonpod.com/wp-content/uploads/2018/09/IMG_5692_square-768x768.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption>Hallie Casey</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img src=\"https://www.onetogrowonpod.com/wp-content/uploads/2018/09/cdc.jpg\" alt=\"Chris in a production of Taming of the Shrew.\" data-id=\"175\" data-link=\"https://www.onetogrowonpod.com/about/cdc/\" class=\"wp-image-175\" srcset=\"https://www.onetogrowonpod.com/wp-content/uploads/2018/09/cdc.jpg 575w, https://www.onetogrowonpod.com/wp-content/uploads/2018/09/cdc-150x150.jpg 150w, https://www.onetogrowonpod.com/wp-content/uploads/2018/09/cdc-300x300.jpg 300w\" sizes=\"(max-width: 575px) 100vw, 575px\" /><figcaption>Chris Casey</figcaption></figure></li><li class=\"blocks-gallery-item\"><figure><img src=\"https://www.onetogrowonpod.com/wp-content/uploads/2018/10/OnetoGrowOn_plays_4-preview-1024x1024.jpg\" alt=\"Vegetables with a pair of headphones around the bottom.\" data-id=\"322\" data-link=\"https://www.onetogrowonpod.com/onetogrowon_plays_4-preview/\" class=\"wp-image-322\" srcset=\"https://www.onetogrowonpod.com/wp-content/uploads/2018/10/OnetoGrowOn_plays_4-preview-1024x1024.jpg 1024w, https://www.onetogrowonpod.com/wp-content/uploads/2018/10/OnetoGrowOn_plays_4-preview-150x150.jpg 150w, https://www.onetogrowonpod.com/wp-content/uploads/2018/10/OnetoGrowOn_plays_4-preview-300x300.jpg 300w, https://www.onetogrowonpod.com/wp-content/uploads/2018/10/OnetoGrowOn_plays_4-preview-768x768.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption>Square Show Art</figcaption></figure></li></ul>\n","slug":"press","id":"b6ec0013-2735-5843-8707-236cddd132d5","date":"February 26, 2019"},"site":{"id":"Site","siteMetadata":{"title":"On to Grow On","subtitle":"Understanding how food production impacts ourselves and our world"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"b6ec0013-2735-5843-8707-236cddd132d5"}}